Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# cache.anySearch.error.unsafeKeyFormat
source: Search cache key contains invalid characters: %@.
ar: مفتاح ذاكرة التخزين المؤقت للبحث يحتوي على أحرف غير صالحة: %@.
de: Suchcache-Schlüssel enthält ungültige Zeichen: %@.
es: La clave de caché de búsqueda contiene caracteres no válidos: %@.
fr: La clé du cache de recherche contient des caractères non valides : %@.
id: Kunci cache pencarian mengandung karakter yang tidak valid: %@.
it: La chiave della cache di ricerca contiene caratteri non validi: %@.
ja: 検索キャッシュキーに無効な文字が含まれています：%@
ko: 검색 캐시 키에 잘못된 문자가 포함되어 있습니다: %@.
nl: Zoekcachesleutel bevat ongeldige tekens: %@.
pl: Klucz pamięci podręcznej wyszukiwania zawiera nieprawidłowe znaki: %@.
pt_br: A chave de cache de busca contém caracteres inválidos: %@.
ru: Ключ кэша поиска содержит недопустимые символы: %@.
tr: Arama önbellek anahtarı geçersiz karakterler içeriyor: %@.
uk: Ключ кешу пошуку містить неприпустимі символи: %@.
vi: Khóa bộ nhớ đệm tìm kiếm chứa ký tự không hợp lệ: %@.
zh_hans: 搜索缓存键包含非法字符：%@。
zh_hant: 搜尋快取鍵包含無效字元：%@。

# cache.readmeTranslation.error.applicationSupportUnavailable
source: Could not locate the translation cache directory. Please retry or restart the app.
ar: تعذر العثور على دليل ذاكرة التخزين المؤقت للترجمة. يرجى إعادة المحاولة أو إعادة تشغيل التطبيق.
de: Das Übersetzungscache-Verzeichnis konnte nicht gefunden werden. Bitte versuchen Sie es erneut oder starten Sie die App neu.
es: No se pudo localizar el directorio de caché de traducción. Vuelve a intentarlo o reinicia la app.
fr: Impossible de localiser le répertoire du cache de traduction. Veuillez réessayer ou redémarrer l'application.
id: Tidak dapat menemukan direktori cache terjemahan. Silakan coba lagi atau mulai ulang aplikasi.
it: Impossibile trovare la directory della cache di traduzione. Riprova o riavvia l'app.
ja: 翻訳キャッシュディレクトリが見つかりませんでした。再試行するか、アプリを再起動してください。
ko: 번역 캐시 디렉토리를 찾을 수 없습니다. 다시 시도하거나 앱을 재시작하세요.
nl: Kan de vertaalcachemap niet vinden. Probeer het opnieuw of start de app opnieuw.
pl: Nie można zlokalizować katalogu pamięci podręcznej tłumaczeń. Spróbuj ponownie lub uruchom aplikację ponownie.
pt_br: Não foi possível localizar o diretório de cache de tradução. Tente novamente ou reinicie o app.
ru: Не удалось найти каталог кэша переводов. Повторите попытку или перезапустите приложение.
tr: Çeviri önbellek dizini bulunamadı. Lütfen tekrar deneyin veya uygulamayı yeniden başlatın.
uk: Не вдалося знайти каталог кешу перекладу. Повторіть спробу або перезапустіть застосунок.
vi: Không tìm thấy thư mục bộ nhớ đệm dịch thuật. Vui lòng thử lại hoặc khởi động lại ứng dụng.
zh_hans: 无法定位翻译缓存目录，请重试或重启应用。
zh_hant: 無法定位翻譯快取目錄，請重試或重新啟動應用程式。

# cache.readmeTranslation.error.invalidPathComponentFormat
source: Translation cache path contains invalid characters: %@.
ar: مسار ذاكرة التخزين المؤقت للترجمة يحتوي على أحرف غير صالحة: %@.
de: Übersetzungscache-Pfad enthält ungültige Zeichen: %@.
es: La ruta de caché de traducción contiene caracteres no válidos: %@.
fr: Le chemin du cache de traduction contient des caractères non valides : %@.
id: Path cache terjemahan mengandung karakter yang tidak valid: %@.
it: Il percorso della cache di traduzione contiene caratteri non validi: %@.
ja: 翻訳キャッシュパスに無効な文字が含まれています：%@
ko: 번역 캐시 경로에 잘못된 문자가 포함되어 있습니다: %@.
nl: Vertaalcachepad bevat ongeldige tekens: %@.
pl: Ścieżka pamięci podręcznej tłumaczeń zawiera nieprawidłowe znaki: %@.
pt_br: O caminho do cache de tradução contém caracteres inválidos: %@.
ru: Путь кэша переводов содержит недопустимые символы: %@.
tr: Çeviri önbellek yolu geçersiz karakterler içeriyor: %@.
uk: Шлях кешу перекладу містить неприпустимі символи: %@.
vi: Đường dẫn bộ nhớ đệm dịch thuật chứa ký tự không hợp lệ: %@.
zh_hans: 翻译缓存路径包含非法字符：%@。
zh_hant: 翻譯快取路徑包含無效字元：%@。

# cache.recommendation.error.applicationSupportUnavailable
source: Could not locate the recommendation cache directory. Please retry or restart the app.
ar: تعذر العثور على دليل ذاكرة التخزين المؤقت للتوصيات. يرجى إعادة المحاولة أو إعادة تشغيل التطبيق.
de: Das Empfehlungscache-Verzeichnis konnte nicht gefunden werden. Bitte versuchen Sie es erneut oder starten Sie die App neu.
es: No se pudo localizar el directorio de caché de recomendaciones. Vuelve a intentarlo o reinicia la app.
fr: Impossible de localiser le répertoire du cache de recommandations. Veuillez réessayer ou redémarrer l'application.
id: Tidak dapat menemukan direktori cache rekomendasi. Silakan coba lagi atau mulai ulang aplikasi.
it: Impossibile trovare la directory della cache dei suggerimenti. Riprova o riavvia l'app.
ja: レコメンデーションキャッシュディレクトリが見つかりませんでした。再試行するか、アプリを再起動してください。
ko: 추천 캐시 디렉토리를 찾을 수 없습니다. 다시 시도하거나 앱을 재시작하세요.
nl: Kan de aanbevelingscachemap niet vinden. Probeer het opnieuw of start de app opnieuw.
pl: Nie można zlokalizować katalogu pamięci podręcznej rekomendacji. Spróbuj ponownie lub uruchom aplikację ponownie.
pt_br: Não foi possível localizar o diretório de cache de recomendações. Tente novamente ou reinicie o app.
ru: Не удалось найти каталог кэша рекомендаций. Повторите попытку или перезапустите приложение.
tr: Öneri önbellek dizini bulunamadı. Lütfen tekrar deneyin veya uygulamayı yeniden başlatın.
uk: Не вдалося знайти каталог кешу рекомендацій. Повторіть спробу або перезапустіть застосунок.
vi: Không tìm thấy thư mục bộ nhớ đệm đề xuất. Vui lòng thử lại hoặc khởi động lại ứng dụng.
zh_hans: 无法定位推荐缓存目录，请重试或重启 App。
zh_hant: 無法定位推薦快取目錄，請重試或重新啟動 App。

# cache.wiki.error.applicationSupportUnavailable
source: Could not locate the wiki cache directory. Please retry or restart the app.
ar: تعذر العثور على دليل ذاكرة التخزين المؤقت للويكي. يرجى إعادة المحاولة أو إعادة تشغيل التطبيق.
de: Das Wiki-Cache-Verzeichnis konnte nicht gefunden werden. Bitte versuchen Sie es erneut oder starten Sie die App neu.
es: No se pudo localizar el directorio de caché de la wiki. Vuelve a intentarlo o reinicia la app.
fr: Impossible de localiser le répertoire du cache wiki. Veuillez réessayer ou redémarrer l'application.
id: Tidak dapat menemukan direktori cache wiki. Silakan coba lagi atau mulai ulang aplikasi.
it: Impossibile trovare la directory della cache wiki. Riprova o riavvia l'app.
ja: Wikiキャッシュディレクトリが見つかりませんでした。再試行するか、アプリを再起動してください。
ko: 위키 캐시 디렉토리를 찾을 수 없습니다. 다시 시도하거나 앱을 재시작하세요.
nl: Kan de wikicachemap niet vinden. Probeer het opnieuw of start de app opnieuw.
pl: Nie można zlokalizować katalogu pamięci podręcznej wiki. Spróbuj ponownie lub uruchom aplikację ponownie.
pt_br: Não foi possível localizar o diretório de cache da wiki. Tente novamente ou reinicie o app.
ru: Не удалось найти каталог кэша вики. Повторите попытку или перезапустите приложение.
tr: Viki önbellek dizini bulunamadı. Lütfen tekrar deneyin veya uygulamayı yeniden başlatın.
uk: Не вдалося знайти каталог кешу вікі. Повторіть спробу або перезапустіть застосунок.
vi: Không tìm thấy thư mục bộ nhớ đệm wiki. Vui lòng thử lại hoặc khởi động lại ứng dụng.
zh_hans: 无法定位 Wiki 缓存目录，请重试或重启应用。
zh_hant: 無法定位 Wiki 快取目錄，請重試或重新啟動應用程式。

# cache.wiki.error.unsafePathComponentFormat
source: Wiki cache path segment contains invalid characters: %@.
ar: مقطع مسار ذاكرة التخزين المؤقت للويكي يحتوي على أحرف غير صالحة: %@.
de: Wiki-Cache-Pfadsegment enthält ungültige Zeichen: %@.
es: El segmento de ruta de caché de la wiki contiene caracteres no válidos: %@.
fr: Le segment du chemin du cache wiki contient des caractères non valides : %@.
id: Segmen path cache wiki mengandung karakter yang tidak valid: %@.
it: Il segmento del percorso della cache wiki contiene caratteri non validi: %@.
ja: Wikiキャッシュパスセグメントに無効な文字が含まれています：%@
ko: 위키 캐시 경로 세그먼트에 잘못된 문자가 포함되어 있습니다: %@.
nl: Wikicachepadsegment bevat ongeldige tekens: %@.
pl: Segment ścieżki pamięci podręcznej wiki zawiera nieprawidłowe znaki: %@.
pt_br: O segmento do caminho do cache da wiki contém caracteres inválidos: %@.
ru: Сегмент пути кэша вики содержит недопустимые символы: %@.
tr: Viki önbellek yolu parçası geçersiz karakterler içeriyor: %@.
uk: Сегмент шляху кешу вікі містить неприпустимі символи: %@.
vi: Đoạn đường dẫn bộ nhớ đệm wiki chứa ký tự không hợp lệ: %@.
zh_hans: Wiki 缓存路径段含非法字符：%@。
zh_hant: Wiki 快取路徑區段包含無效字元：%@。

# clone.copiedGit
source: Copied Git Clone URL
ar: تم نسخ رابط Git للاستنساخ
de: Git-Klon-URL kopiert
es: URL de clonación Git copiada
fr: URL de clonage Git copiée
id: URL Clone Git Disalin
it: URL clone Git copiato
ja: Git Clone URLをコピーしました
ko: Git 클론 URL 복사됨
nl: Git-kloon-URL gekopieerd
pl: Skopiowano URL klonowania Git
pt_br: URL de clone Git copiada
ru: Скопирован URL клона Git
tr: Git Klon URL'si Kopyalandı
uk: Скопійовано URL Git Clone
vi: Đã sao chép URL sao chép Git
zh_hans: 已复制 Git Clone URL
zh_hant: 已複製 Git Clone URL

# clone.copiedHttps
source: Copied HTTPS Clone URL
ar: تم نسخ رابط HTTPS للاستنساخ
de: HTTPS-Klon-URL kopiert
es: URL de clonación HTTPS copiada
fr: URL de clonage HTTPS copiée
id: URL Clone HTTPS Disalin
it: URL clone HTTPS copiato
ja: HTTPS Clone URLをコピーしました
ko: HTTPS 클론 URL 복사됨
nl: HTTPS-kloon-URL gekopieerd
pl: Skopiowano URL klonowania HTTPS
pt_br: URL de clone HTTPS copiada
ru: Скопирован URL клона HTTPS
tr: HTTPS Klon URL'si Kopyalandı
uk: Скопійовано URL HTTPS Clone
vi: Đã sao chép URL sao chép HTTPS
zh_hans: 已复制 HTTPS Clone URL
zh_hant: 已複製 HTTPS Clone URL

# clone.hint
source: Copy Clone URL
ar: نسخ رابط الاستنساخ
de: Klon-URL kopieren
es: Copiar URL de clonación
fr: Copier l'URL de clonage
id: Salin URL Clone
it: Copia URL clone
ja: Clone URLをコピー
ko: 클론 URL 복사
nl: Kloon-URL kopiëren
pl: Kopiuj URL klonowania
pt_br: Copiar URL de clone
ru: Скопировать URL клона
tr: Klon URL'sini Kopyala
uk: Копіювати URL клонування
vi: Sao chép URL sao chép
zh_hans: 复制 Clone 地址
zh_hant: 複製 Clone 位址

# codebaseMemory.error.archiveTooLargeFormat
source: The repository archive is too large: %1$d bytes
ar: أرشيف المستودع كبير جدًا: %1$d بايت
de: Das Repository-Archiv ist zu groß: %1$d Bytes
es: El archivo del repositorio es demasiado grande: %1$d bytes
fr: L'archive du dépôt est trop volumineuse : %1$d octets
id: Arsip repositori terlalu besar: %1$d byte
it: L'archivio del repository è troppo grande: %1$d byte
ja: リポジトリアーカイブが大きすぎます: %1$d バイト
ko: 저장소 아카이브가 너무 큽니다: %1$d 바이트
nl: Het repository-archief is te groot: %1$d bytes
pl: Archiwum repozytorium jest zbyt duże: %1$d bajtów
pt_br: O arquivo do repositório é muito grande: %1$d bytes
ru: Архив репозитория слишком велик: %1$d байт
tr: Depo arşivi çok büyük: %1$d bayt
uk: Архів репозиторію завеликий: %1$d байтів
vi: Tệp lưu trữ kho quá lớn: %1$d byte
zh_hans: 仓库存档过大：%1$d 字节
zh_hant: 仓库存档过大：%1$d 字节

# codebaseMemory.error.binaryMissing
source: CodebaseMemory binary not found in the app bundle.
ar: لم يتم العثور على ثنائي CodebaseMemory في حزمة التطبيق.
de: CodebaseMemory-Binärdatei nicht im App-Bundle gefunden.
es: No se encontró el binario de CodebaseMemory en el paquete de la app.
fr: Binaire CodebaseMemory introuvable dans le bundle de l'application.
id: Biner CodebaseMemory tidak ditemukan di bundel aplikasi.
it: Binario CodebaseMemory non trovato nel bundle dell'app.
ja: CodebaseMemory バイナリがアプリバンドル内に見つかりません。
ko: 앱 번들에서 CodebaseMemory 바이너리를 찾을 수 없습니다.
nl: CodebaseMemory-binary niet gevonden in de app-bundel.
pl: Nie znaleziono pliku binarnego CodebaseMemory w pakiecie aplikacji.
pt_br: Binário do CodebaseMemory não encontrado no pacote do app.
ru: Двоичный файл CodebaseMemory не найден в пакете приложения.
tr: CodebaseMemory ikili dosyası uygulama paketinde bulunamadı.
uk: Двійковий файл CodebaseMemory не знайдено в пакеті застосунку.
vi: Không tìm thấy tệp nhị phân CodebaseMemory trong gói ứng dụng.
zh_hans: CodebaseMemory 二进制未打包到 App 中。
zh_hant: CodebaseMemory 二进制未打包到 App 中。

# codebaseMemory.error.binaryNotExecutable
source: CodebaseMemory binary is not executable.
ar: ثنائي CodebaseMemory غير قابل للتنفيذ.
de: CodebaseMemory-Binärdatei ist nicht ausführbar.
es: El binario de CodebaseMemory no es ejecutable.
fr: Le binaire CodebaseMemory n'est pas exécutable.
id: Biner CodebaseMemory tidak dapat dieksekusi.
it: Il binario CodebaseMemory non è eseguibile.
ja: CodebaseMemory バイナリが実行可能ではありません。
ko: CodebaseMemory 바이너리를 실행할 수 없습니다.
nl: CodebaseMemory-binary is niet uitvoerbaar.
pl: Plik binarny CodebaseMemory nie jest wykonywalny.
pt_br: O binário do CodebaseMemory não é executável.
ru: Двоичный файл CodebaseMemory не является исполняемым.
tr: CodebaseMemory ikili dosyası çalıştırılabilir değil.
uk: Двійковий файл CodebaseMemory не є виконуваним.
vi: Tệp nhị phân CodebaseMemory không thể thực thi.
zh_hans: CodebaseMemory 二进制不可执行。
zh_hant: CodebaseMemory 二进制不可执行。

# codebaseMemory.error.browserOpenFailed
source: Unable to open the 3D graph in the browser.
ar: تعذر فتح الرسم البياني ثلاثي الأبعاد في المتصفح.
de: Der 3D-Graph konnte nicht im Browser geöffnet werden.
es: No se puede abrir el grafo 3D en el navegador.
fr: Impossible d'ouvrir le graphe 3D dans le navigateur.
id: Tidak dapat membuka grafik 3D di browser.
it: Impossibile aprire il grafo 3D nel browser.
ja: ブラウザで 3D グラフを開けません。
ko: 브라우저에서 3D 그래프를 열 수 없습니다.
nl: Kan de 3D-grafiek niet openen in de browser.
pl: Nie można otworzyć grafu 3D w przeglądarce.
pt_br: Não foi possível abrir o grafo 3D no navegador.
ru: Не удалось открыть 3D-граф в браузере.
tr: 3D grafik tarayıcıda açılamıyor.
uk: Не вдалося відкрити 3D-граф у браузері.
vi: Không thể mở đồ thị 3D trong trình duyệt.
zh_hans: 无法在浏览器中打开 3D 图谱。
zh_hant: 无法在浏览器中打开 3D 图谱。

# codebaseMemory.error.emptyArchive
source: The repository archive is empty.
ar: أرشيف المستودع فارغ.
de: Das Repository-Archiv ist leer.
es: El archivo del repositorio está vacío.
fr: L'archive du dépôt est vide.
id: Arsip repositori kosong.
it: L'archivio del repository è vuoto.
ja: リポジトリアーカイブが空です。
ko: 저장소 아카이브가 비어 있습니다.
nl: Het repository-archief is leeg.
pl: Archiwum repozytorium jest puste.
pt_br: O arquivo do repositório está vazio.
ru: Архив репозитория пуст.
tr: Depo arşivi boş.
uk: Архів репозиторію порожній.
vi: Tệp lưu trữ kho rỗng.
zh_hans: 仓库存档为空。
zh_hant: 仓库存档为空。

# codebaseMemory.error.extractedTooLargeFormat
source: Extracted directory is too large: %d bytes
ar: الدليل المستخرج كبير جدًا: %d بايت
de: Extrahiertes Verzeichnis ist zu groß: %d Bytes
es: El directorio extraído es demasiado grande: %d bytes
fr: Le répertoire extrait est trop volumineux : %d octets
id: Direktori yang diekstrak terlalu besar: %d byte
it: La directory estratta è troppo grande: %d byte
ja: 展開されたディレクトリが大きすぎます: %d バイト
ko: 추출된 디렉토리가 너무 큽니다: %d 바이트
nl: Uitgepakte map is te groot: %d bytes
pl: Wyodrębniony katalog jest zbyt duży: %d bajtów
pt_br: O diretório extraído é muito grande: %d bytes
ru: Извлеченный каталог слишком велик: %d байт
tr: Çıkarılan dizin çok büyük: %d bayt
uk: Видобутий каталог завеликий: %d байтів
vi: Thư mục giải nén quá lớn: %d byte
zh_hans: 解压目录过大：%d 字节
zh_hant: 解压目录过大：%d 字节

# codebaseMemory.error.indexFailedFormat
source: Code indexing failed: %@
ar: فشلت فهرسة الكود: %@
de: Code-Indizierung fehlgeschlagen: %@
es: La indexación de código falló: %@
fr: L'indexation du code a échoué : %@
id: Pengindeksan kode gagal: %@
it: Indicizzazione del codice fallita: %@
ja: コードのインデックス作成に失敗しました: %@
ko: 코드 인덱싱 실패: %@
nl: Code-indexering mislukt: %@
pl: Indeksowanie kodu nie powiodło się: %@
pt_br: Falha na indexação do código: %@
ru: Индексация кода не удалась: %@
tr: Kod indeksleme başarısız: %@
uk: Індексація коду не вдалася: %@
vi: Lập chỉ mục mã thất bại: %@
zh_hans: 代码索引失败：%@
zh_hant: 代码索引失败：%@

# codebaseMemory.error.invalidArgumentsFormat
source: Invalid arguments: %@
ar: وسائط غير صالحة: %@
de: Ungültige Argumente: %@
es: Argumentos no válidos: %@
fr: Arguments non valides : %@
id: Argumen tidak valid: %@
it: Argomenti non validi: %@
ja: 無効な引数: %@
ko: 잘못된 인수: %@
nl: Ongeldige argumenten: %@
pl: Nieprawidłowe argumenty: %@
pt_br: Argumentos inválidos: %@
ru: Недопустимые аргументы: %@
tr: Geçersiz argümanlar: %@
uk: Неправильні аргументи: %@
vi: Đối số không hợp lệ: %@
zh_hans: 参数非法：%@
zh_hant: 参数非法：%@

# codebaseMemory.error.portExhausted
source: Unable to find an available port for the 3D graph UI.
ar: تعذر العثور على منفذ متاح لواجهة الرسم البياني ثلاثي الأبعاد.
de: Für die 3D-Grafikoberfläche konnte kein freier Port gefunden werden.
es: No se pudo encontrar un puerto disponible para la interfaz del gráfico 3D.
fr: Impossible de trouver un port disponible pour l'interface du graphe 3D.
id: Tidak dapat menemukan port yang tersedia untuk UI grafik 3D.
it: Impossibile trovare una porta disponibile per l'interfaccia del grafico 3D.
ja: 3D グラフ UI に使用可能なポートが見つかりません。
ko: 3D 그래프 UI에 사용 가능한 포트를 찾을 수 없습니다.
nl: Kan geen beschikbare poort vinden voor de 3D-grafiekinterface.
pl: Nie można znaleźć dostępnego portu dla interfejsu 3D grafu.
pt_br: Não foi possível encontrar uma porta disponível para a interface gráfica 3D.
ru: Не удалось найти доступный порт для интерфейса 3D-графа.
tr: 3B grafik arayüzü için uygun bir port bulunamadı.
uk: Не вдалося знайти доступний порт для інтерфейсу 3D-графіки.
vi: Không tìm thấy cổng khả dụng cho giao diện đồ họa 3D.
zh_hans: 无法找到可用端口来启动 3D 图谱 UI。
zh_hant: 无法找到可用端口来启动 3D 图谱 UI。

# codebaseMemory.error.uiStartFailedFormat
source: Failed to start the 3D graph UI: %@
ar: فشل بدء واجهة الرسم البياني ثلاثي الأبعاد: %@
de: Die 3D-Grafikoberfläche konnte nicht gestartet werden: %@
es: Error al iniciar la interfaz del gráfico 3D: %@
fr: Échec du démarrage de l'interface du graphe 3D : %@
id: Gagal memulai UI grafik 3D: %@
it: Impossibile avviare l'interfaccia del grafico 3D: %@
ja: 3D グラフ UI の起動に失敗しました: %@
ko: 3D 그래프 UI를 시작하지 못했습니다: %@
nl: Kan de 3D-grafiekinterface niet starten: %@
pl: Nie udało się uruchomić interfejsu 3D grafu: %@
pt_br: Falha ao iniciar a interface gráfica 3D: %@
ru: Не удалось запустить интерфейс 3D-графа: %@
tr: 3B grafik arayüzü başlatılamadı: %@
uk: Не вдалося запустити інтерфейс 3D-графіки: %@
vi: Không thể khởi động giao diện đồ họa 3D: %@
zh_hans: 无法启动 3D 图谱 UI：%@
zh_hant: 无法启动 3D 图谱 UI：%@

# codebaseMemory.overview.download.detail
source: Pinned-commit shared snapshot
ar: لقطة مشتركة مثبتة على الالتزام
de: Gepinnte Commit-Freigabe-Snapshot
es: Instantánea compartida de commit fijado
fr: Instantané partagé d'un commit épinglé
id: Snapshot bersama dengan commit tetap
it: Snapshot condiviso di commit fissato
ja: 固定コミットの共有スナップショット
ko: 고정 커밋 공유 스냅샷
nl: Gedeelde momentopname van vastgezette commit
pl: Migawka współdzielona z przypiętym zatwierdzeniem
pt_br: Snapshot compartilhado do commit fixado
ru: Общий снимок с закреплённым коммитом
tr: Sabitlenmiş commit paylaşımlı anlık görüntü
uk: Спільний знімок зафіксованого коміту
vi: Ảnh chụp nhanh từ commit đã ghim
zh_hans: 固定 commit 共享快照
zh_hant: 固定 commit 共享快照

# codebaseMemory.overview.download.title
source: Download
ar: تنزيل
de: Herunterladen
es: Descargar
fr: Télécharger
id: Unduh
it: Scarica
ja: ダウンロード
ko: 다운로드
nl: Downloaden
pl: Pobierz
pt_br: Baixar
ru: Загрузить
tr: İndir
uk: Завантажити
vi: Tải xuống
zh_hans: 下载仓库
zh_hant: 下载仓库

# codebaseMemory.overview.index.detail
source: Extract source + tree-sitter parse
ar: استخراج المصدر + تحليل tree-sitter
de: Quelltext extrahieren + Tree-Sitter-Parse
es: Extraer fuente + análisis tree-sitter
fr: Extraire les sources + analyse tree-sitter
id: Ekstrak sumber + parse tree-sitter
it: Estrai sorgente + analisi tree-sitter
ja: ソースの抽出 + tree-sitter 解析
ko: 소스 추출 + tree-sitter 파싱
nl: Broncode extraheren + tree-sitter parseren
pl: Wyodrębnij źródło + parsowanie tree-sitter
pt_br: Extrair código-fonte + análise tree-sitter
ru: Извлечение исходного кода + разбор tree-sitter
tr: Kaynak çıkar + tree-sitter ayrıştırma
uk: Видобути вихідний код + tree-sitter розбір
vi: Trích xuất mã nguồn + phân tích cây cú pháp
zh_hans: 解压源码并构建知识图谱
zh_hant: 解压源码并构建知识图谱

# codebaseMemory.overview.index.title
source: Index
ar: فهرسة
de: Indizieren
es: Indexar
fr: Indexer
id: Indeks
it: Indicizza
ja: インデックス
ko: 인덱싱
nl: Indexeren
pl: Indeksuj
pt_br: Indexar
ru: Индексация
tr: Dizinle
uk: Індексувати
vi: Lập chỉ mục
zh_hans: 构建索引
zh_hant: 构建索引

# codebaseMemory.overview.launch.detail
source: Start 3D graph server & open browser
ar: بدء خادم الرسم البياني ثلاثي الأبعاد وفتح المتصفح
de: 3D-Graph-Server starten & Browser öffnen
es: Iniciar servidor de gráfico 3D y abrir navegador
fr: Démarrer le serveur du graphe 3D et ouvrir le navigateur
id: Mulai server grafik 3D & buka browser
it: Avvia server grafico 3D e apri browser
ja: 3D グラフサーバーを起動してブラウザを開く
ko: 3D 그래프 서버 시작 및 브라우저 열기
nl: 3D-grafiekserver starten en browser openen
pl: Uruchom serwer 3D grafu i otwórz przeglądarkę
pt_br: Iniciar servidor do gráfico 3D e abrir navegador
ru: Запуск сервера 3D-графа и открытие браузера
tr: 3B grafik sunucusunu başlat ve tarayıcıyı aç
uk: Запустити сервер 3D-графіки та відкрити браузер
vi: Khởi động máy chủ đồ họa 3D & mở trình duyệt
zh_hans: 启动 3D 图谱服务并打开浏览器
zh_hant: 启动 3D 图谱服务并打开浏览器

# codebaseMemory.overview.launch.title
source: Launch
ar: إطلاق
de: Starten
es: Iniciar
fr: Lancer
id: Luncurkan
it: Avvia
ja: 起動
ko: 실행
nl: Starten
pl: Uruchom
pt_br: Iniciar
ru: Запустить
tr: Başlat
uk: Запустити
vi: Khởi chạy
zh_hans: 启动可视化
zh_hant: 启动可视化

# codebaseMemory.overview.prepare.detail
source: Verify & resolve
ar: تحقق وحل
de: Überprüfen & auflösen
es: Verificar y resolver
fr: Vérifier et résoudre
id: Verifikasi & selesaikan
it: Verifica e risolvi
ja: 検証と解決
ko: 확인 및 해결
nl: Controleren en oplossen
pl: Zweryfikuj i rozwiąż
pt_br: Verificar e resolver
ru: Проверка и разрешение
tr: Doğrula ve çözümle
uk: Перевірити та вирішити
vi: Xác minh & giải quyết
zh_hans: 验证二进制与解析分支
zh_hant: 验证二进制与解析分支

# codebaseMemory.overview.prepare.title
source: Prepare
ar: تحضير
de: Vorbereiten
es: Preparar
fr: Préparer
id: Siapkan
it: Prepara
ja: 準備
ko: 준비
nl: Voorbereiden
pl: Przygotuj
pt_br: Preparar
ru: Подготовка
tr: Hazırla
uk: Підготувати
vi: Chuẩn bị
zh_hans: 准备环境
zh_hant: 准备环境

# codebaseMemory.panel.branch.title
source: Branch
ar: فرع
es: Rama
fr: Branche
id: Cabang
ja: ブランチ
ko: 브랜치
pl: Gałąź
ru: Ветка
tr: Dal
uk: Гілка
vi: Nhánh
zh_hans: 分支
zh_hant: 分支

# codebaseMemory.panel.executionDetails
source: Execution Details
ar: تفاصيل التنفيذ
de: Ausführungsdetails
es: Detalles de ejecución
fr: Détails d'exécution
id: Detail Eksekusi
it: Dettagli esecuzione
ja: 実行の詳細
ko: 실행 세부 정보
nl: Uitvoeringsdetails
pl: Szczegóły wykonania
pt_br: Detalhes da Execução
ru: Детали выполнения
tr: Yürütme Ayrıntıları
uk: Деталі виконання
vi: Chi tiết thực thi
zh_hans: 执行详情
zh_hant: 执行详情

# codebaseMemory.panel.openInBrowser
source: Open in Browser
ar: فتح في المتصفح
de: Im Browser öffnen
es: Abrir en el navegador
fr: Ouvrir dans le navigateur
id: Buka di Browser
it: Apri nel browser
ja: ブラウザで開く
ko: 브라우저에서 열기
nl: Openen in browser
pl: Otwórz w przeglądarce
pt_br: Abrir no Navegador
ru: Открыть в браузере
tr: Tarayıcıda Aç
uk: Відкрити в браузері
vi: Mở trong trình duyệt
zh_hans: 在浏览器中打开
zh_hant: 在浏览器中打开

# codebaseMemory.panel.regenerate
source: Re-generate
ar: إعادة التوليد
de: Neu generieren
es: Regenerar
fr: Régénérer
id: Hasilkan Ulang
it: Rigenera
ja: 再生成
ko: 재생성
nl: Opnieuw genereren
pl: Wygeneruj ponownie
pt_br: Regenerar
ru: Перегенерировать
tr: Yeniden oluştur
uk: Перегенерувати
vi: Tạo lại
zh_hans: 重新生成
zh_hant: 重新生成

# codebaseMemory.panel.start
source: Start
ar: بدء
de: Starten
es: Iniciar
fr: Démarrer
id: Mulai
it: Avvia
ja: 開始
ko: 시작
nl: Starten
pt_br: Iniciar
ru: Начать
tr: Başlat
uk: Почати
vi: Bắt đầu
zh_hans: 开始
zh_hant: 开始
